[
    {
        "anio": "2021",
        "desc": "Participación en el congreso “ENC2021: Encuentro Nacional de Computación” con el paper “Implementación de un servicio REST-API para el uso de la Firma Electrónica en instituciones públicas.”.",
        "link": ""
    },
    {
        "anio": "2020",
        "desc": "Docente del curso “Investigación de Delitos Cibernéticos y Seguridad de la Información” en el Instituto de Formación en Seguridad Pública del Estado (INFOSPE) en Guanajuato, Guanajuato.",
        "link": ""
    },
    {
        "anio": "2020",
        "desc": "Docente del curso “Investigación de Delitos Cibernéticos y Seguridad de la Información” en la Academia Estatal de Seguridad Pública en La Paz, Baja California Sur.",
        "link": "https://bit.ly/3eo9S1c"
    },
    {
        "anio": "2020",
        "desc": "Participación en Hackathon “InnovationFest 2020”.",
        "link": ""
    },
    {
        "anio": "2019",
        "desc": "Docente del curso “Investigación de Delitos Cibernéticos y Seguridad de la Información” en el Instituto Estatal de Estudios Superiores en Seguridad Pública y Policial, en Morelia, Michoacán.",
        "link": "https://bit.ly/3fp8UoQ"
    },
    {
        "anio": "2019",
        "desc": "Participación en Hackathon “IT Challenge Cinepolis”, obteniendo un lugares ganador.",
        "link": "https://bit.ly/3wDz6ls"
    },
    {
        "anio": "2019",
        "desc": "Participación en Hackathon “HackLeón”.",
        "link": ""
    },
    {
        "anio": "2019",
        "desc": "Participación  en  Hackathon  “InnovationFest  2019”,  obteniendo  Segundo  Lugar.",
        "link": "http://bit.do/eQZBK"
    },
    {
        "anio": "2018",
        "desc": "Participación en “Hackathon SAP”, obteniendo Segundo Lugar.",
        "link": ""
    },
    {
        "anio": "2018",
        "desc": "Participación  en  el  Curso  “Medidas  de  seguridad  en  los  sistemas  de  información para la protección de los datos personales”.",
        "link": ""
    },
    {
        "anio": "2017",
        "desc": "Curso Inteligencia de Negocios aplicada a la administración pública.",
        "link": ""
    },
    {
        "anio": "2017",
        "desc": "Curso Sistema de información y Benchmarking.",
        "link": ""
    },
    {
        "anio": "2017",
        "desc": "Curso Introducción a las Bases de Datos.",
        "link": ""
    },
    {
        "anio": "2017",
        "desc": "Curso de Administración del Conocimiento Aplicado a la Tecnología.",
        "link": ""
    },
    {
        "anio": "2017",
        "desc": "Curso Taller en Administración avanzada de base de datos SQL Server 2012.",
        "link": ""
    },
    {
        "anio": "2017",
        "desc": "Taller de Herramientas de Seguridad Informática.",
        "link": ""
    },
    {
        "anio": "2017",
        "desc": "Diplomado  de  Fundamentos  de  SCRUM,  Instituto  Tecnológico  de  Teléfonos  de México S.C INT TELMEX.",
        "link": ""
    },
    {
        "anio": "2017",
        "desc": "Reconocimiento por la “Implementación del Nuevo Sistema de Justicia Penal en el Estado de Michoacán”.",
        "link": ""
    },
    {
        "anio": "2016",
        "desc": "Taller de Diseño y Desarrollo de Videojuegos en Unity por Microsoft México.",
        "link": ""
    }
]